Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.ATFXImportOptions)
Imports an ATFX file into the document.
file:
Full path of the file to import. File must exist and must be a valid ATFX file.
options:
Various import options applicable to the ATFX format. If null, all options will be set to their respective default values.
Returns:
Returns the element Ids of the created DirectShapes.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for ATFX import (.atfxz files are valid).
-or-
NullOrEmpty
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
Document this Document may not contain DirectShape or DirectShapeType objects.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The IFC Import/Link module is not available in the installed Revit.
Since:
2023

Autodesk.Revit.DB.Document.IncrementalExport(System.String,Autodesk.Revit.DB.FDXBaseExportOptions)
Incrementally exports the view specified in the export options to an FDX cloud data exchange.
exchangeFileUrn:
URN of the file hosting an existing FDX exchange.
options:
Various options applicable to the FDX format.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The provided options are not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The ShapeExporter functionality is not available in the installed Revit.
Since:
2023

Autodesk.Revit.DB.Document.IncrementalExport(System.String,System.String,Autodesk.Revit.DB.FDXBaseExportOptions)
Incrementally exports the view specified in the export options to FDX payload, as a JSON file and associated binary files.
folder:
Output folder into which the files will be exported. The folder must exist.
name:
The name of the FDX JSON file for export. The extension ".fdxj" will be added automatically if not present.
The name cannot be empty and cannot contain any of the following characters: \/:*?"<>|.
options:
Various options applicable to the FDX format.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters.
-or-
The provided options are not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The ShapeExporter functionality is not available in the installed Revit.
Since:
2023

Autodesk.Revit.DB.Document.Export(System.String,Autodesk.Revit.DB.FDXBaseExportOptions)
Exports the view specified in the export options to an FDX cloud data exchange.
exchangeFileUrn:
URN of the file hosting an existing FDX exchange.
options:
Various options applicable to the FDX format.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The provided options are not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The ShapeExporter functionality is not available in the installed Revit.
Since:
2023

Autodesk.Revit.DB.Document.Export(System.String,System.String,Autodesk.Revit.DB.FDXBaseExportOptions)
Exports the view specified in the export options to FDX payload, as a JSON file and associated binary files.
folder:
Output folder into which the files will be exported. The folder must exist.
name:
The name of the FDX JSON file for export. The extension ".fdxj" will be added automatically if not present.
The name cannot be empty and cannot contain any of the following characters: \/:*?"<>|.
options:
Various options applicable to the FDX format.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters.
-or-
The provided options are not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The ShapeExporter functionality is not available in the installed Revit.
Since:
2023